# Data Frames

In [4]:
import numpy as np
import pandas as pd

In [5]:
from numpy.random import randn

In [20]:
np.random.seed(101)

In [24]:
df = pd.DataFrame(randn(5,4))
df

          0         1         2         3
0  0.386030  2.084019 -0.376519  0.230336
1  0.681209  1.035125 -0.031160  1.939932
2 -1.005187 -0.741790  0.187125 -0.732845
3 -1.382920  1.482495  0.961458 -2.141212
4  0.992573  1.192241 -1.046780  1.292765

In [22]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'])
df

          0         1         2         3
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [26]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['w','x','y','z']) # DataFrame(data,row,column)
df

          w         x         y         z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

#  Indexing & Selection to grab one of the subjects

In [27]:
df['w'] # The output is actually a series; selecting a column

A   -1.467514
B    0.392489
C    0.666319
D    0.641806
E   -1.972605
Name: w, dtype: float64

In [29]:
df.w # familiar with sql

A   -1.467514
B    0.392489
C    0.666319
D    0.641806
E   -1.972605
Name: w, dtype: float64

In [31]:
df[['y','z']]

          y         z
A -0.162535  0.485809
B -0.855196  1.541990
C -0.568581  1.407338
D -0.391157  1.028293
E  0.720788 -1.223082

In [32]:
# iseng coba sendiri

In [73]:
trial = pd.DataFrame(np.arange(1,16).reshape(5,3),['A','B','C','D','E'],['x','y','z'])
trial

    x   y   z
A   1   2   3
B   4   5   6
C   7   8   9
D  10  11  12
E  13  14  15

In [74]:
trial['sum'] = trial['x'] + trial['y'] + trial['z']
trial

    x   y   z  sum
A   1   2   3    6
B   4   5   6   15
C   7   8   9   24
D  10  11  12   33
E  13  14  15   42

In [75]:
trial.drop('sum',1) # 1 is column

    x   y   z
A   1   2   3
B   4   5   6
C   7   8   9
D  10  11  12
E  13  14  15

In [76]:
trial.drop('E',0) # 0 is row. THERE IS STILL SUM COLUMN: It's because the inplace argument is still False

    x   y   z  sum
A   1   2   3    6
B   4   5   6   15
C   7   8   9   24
D  10  11  12   33

In [77]:
trial

    x   y   z  sum
A   1   2   3    6
B   4   5   6   15
C   7   8   9   24
D  10  11  12   33
E  13  14  15   42

In [78]:
trial.drop('E',0,inplace = True);
trial

    x   y   z  sum
A   1   2   3    6
B   4   5   6   15
C   7   8   9   24
D  10  11  12   33

In [80]:
trial.drop('sum',1,inplace=True)
trial

    x   y   z
A   1   2   3
B   4   5   6
C   7   8   9
D  10  11  12

# selecting column

In [81]:
trial = pd.DataFrame(np.arange(1,16).reshape(5,3),['A','B','C','D','E'],['x','y','z'])
trial

    x   y   z
A   1   2   3
B   4   5   6
C   7   8   9
D  10  11  12
E  13  14  15

In [83]:
trial['x']

A     1
B     4
C     7
D    10
E    13
Name: x, dtype: int32

In [84]:
trial[['x','y']] # selecting columns by passing a list of the column names

    x   y
A   1   2
B   4   5
C   7   8
D  10  11
E  13  14

# selecting row

In [85]:
trial

    x   y   z
A   1   2   3
B   4   5   6
C   7   8   9
D  10  11  12
E  13  14  15

In [87]:
trial.loc['E']
# not only are all the columns series, but the rows are series as well

x    13
y    14
z    15
Name: E, dtype: int32

In [89]:
# selecting a row based of the index position
trial.iloc[4]

x    13
y    14
z    15
Name: E, dtype: int32

# selecting subsets of row and column

In [90]:
trial

    x   y   z
A   1   2   3
B   4   5   6
C   7   8   9
D  10  11  12
E  13  14  15

In [92]:
trial.loc['C','z']

9

In [93]:
trial.iloc[2,2]

9

In [95]:
trial.loc[['A','B'],'x']

A    1
B    4
Name: x, dtype: int32

In [102]:
trial.iloc[[:1],0]

SyntaxError: invalid syntax (<ipython-input-102-8a468f13e538>, line 1)

In [103]:
trial.iloc[[0,1],0]

A    1
B    4
Name: x, dtype: int32

In [104]:
trial.loc[['B','D'],['y','x']]

    y   x
B   5   4
D  11  10